export const dataaboutme = {
    description:"لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل.",
    job: "أستاذ جامعي",
    date:"2020-12-31",
    company: "CleverZone.link",
    city: "باب الزوار، الجزائر",
    website: "www.mouadh.com",
  };

export const  dataprofile = {
  lastName:"تجروني",
  firstName:"عادل محمد ",
  job:"مطور ويب",
  birthday:"1997/02/24",
  nationality:"الجزائر"
}

export const databadges = [
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/04.png",
    },
  ];
  
export const datausers = [
    {
      id:1,
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 2,
      invitationStatus: "sent",
    },
    {
      id:2,
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 0,
      invitationStatus: "notSent",
    },
    {
      id:3,
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 5,
      invitationStatus: "sent",
    },
    {
      id:4,
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 2,
      invitationStatus: "accepted",
    },
    {
      id:5,
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 2,
      invitationStatus: "sent",
    },
  ];
  
export const dataeducations = [
    {
      id:1,
      university: "جامعة الهواري بومدين - باب الزوار / الجزائر",
      title: "شهادة ليسانس  في العلوم الإجتماعية",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
    },
    {
      id:2,
      university: "جامعة الهواري بومدين - باب الزوار / الجزائر",
      title: "شهادة الماستر  في العلوم الإجتماعية",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
    },
    {
      id:3,
      university: "جامعة الهواري بومدين - باب الزوار / الجزائر",
      title: "شهادة الدكتوراه  في العلوم الإجتماعية",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
    },
  ];
export const dataexperiences = [
    {
      id:1,
      title: "مطور ويب",
      company: "CleverZone.ink",
      location: "الجزائر",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
    },
    {
      id:2,
      title: "مطور ويب",
      company: "CleverZone.ink",
      location: "الجزائر",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
    },
    {
      id:3,
      title: "مطور ويب",
      company: "CleverZone.ink",
      location: "الجزائر",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
    },
  ];
  
export const datacertifications = [
    {
      id:1,
      title: "شهادة الماستر",
      provider: "جامعة الهواري بومدين",
      startDate:"2020-12-31",
      endDate: "لا تاريخ انتهاء الصلاحية",
      link: {
        url: "",
        label: "إطلع على الإعتماد",
      },
    },
    {
      id:2,
      title: "شهادة الماستر",
      provider: "جامعة الهواري بومدين",
      startDate:"2020-12-31",
      endDate: "لا تاريخ انتهاء الصلاحية",
      link: {
        url: "",
        label: "إطلع على الإعتماد",
      },
    },
    {
      id:3,
      title: "شهادة الماستر",
      provider: "جامعة الهواري بومدين",
      startDate:"2020-12-31",
      endDate: "لا تاريخ انتهاء الصلاحية",
      link: {
        url: "",
        label: "إطلع على الإعتماد",
      },
    },
  ];
export const datavolunteerings = [
    {
      id:1,
      organization: "جمعية ورقة لحماية البيئة",
      role: "متطوع في دور معين",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين",
    },
    {
      id:2,
      organization: "جمعية ورقة لحماية البيئة",
      role: "متطوع في دور معين",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين",
    },
    {
      id:3,
      organization: "جمعية ورقة لحماية البيئة",
      role: "متطوع في دور معين",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين",
    },
  ];
  
export const dataarticles = [
    {
      id:1,
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "6 days ago",
    },
    {
      id:2,
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "1 day ago",
    },
    {
      id:3,
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "3 weeks ago",
    },
    {
      id:4,
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "6 years ago",
    },
    {
      id:5,
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "1 month ago",
    },
  ];
  
export const datagroups = [
    {
      id:1,
      name: "مجموعة معينة",
      members: 134,
    },
    {
      id:2,
      name: "مجموعة معينة",
      members: 440,
    },
    {
      id:3,
      name: "مجموعة معينة",
      members: 235,
    },
    {
      id:4,
      name: "مجموعة معينة",
      members: 34,
    },
  ];
  
export const dataprojects = [
    {
      id:1,
      title: "المشروع الفلاني الأول",
      startDate:"2020-12-31",
      endDate: null,
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      id:2,
      title: "المشروع الفلاني الثاني",
      startDate:"2020-12-31",
      endDate:"2021-12-31",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      id:3,
      title: "المشروع الفلاني الثالث",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
  ];
  
export const datalanguages = [
    {
      id:1,
      name: "العربية",
      level: "اللغة الأم أومستوى احترافي",
    },
    {
      id:2,
      name: "الإنجليزية",
      level: "مستوى احترافي",
    },
    {
      id:3,
      name: "الفرنسية",
      level: "مستوى متوسط",
    },
  ];
  
export const dataactivities = [
    {
      id:1,
      title: "النشاط الفلاني الأول",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      center: "مؤسسة الرؤيا للأبحاث الفلكية",
      role: "محاضر",
      location: "مصر",
    },
    {
      id:2,
      title: "النشاط الفلاني الأول",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      center: "مؤسسة الرؤيا للأبحاث الفلكية",
      role: "محاضر",
      location: "مصر",
    },
    {
      id:3,
      title: "النشاط الفلاني الأول",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      center: "مؤسسة الرؤيا للأبحاث الفلكية",
      role: "محاضر",
      location: "مصر",
    },
  ];
  
export const datapatents = [
    {
      id:1,
      title: "براءة الاختراع الأولى",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      status: "تم الاصدار",
      center: "المكتب الفلاني للإختراعات",
      code: "ED1059",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      id:2,
      title: "براءة الاختراع الأولى",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      status: "تم الاصدار",
      center: "المكتب الفلاني للإختراعات",
      code: "ED1059",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      id:3,
      title: "براءة الاختراع الأولى",
      startDate:"2020-12-31",
      endDate: "2021-12-31",
      status: "تم الاصدار",
      center: "المكتب الفلاني للإختراعات",
      code: "ED1059",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
  ];
  
export const datahonors = [
    {
      id:1,
      title: "التكريم الفلاني الأول",
      date: "2020-12-31",
      center: "مركز الرؤيا للأبحاث الفلكية",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      id:2,
      title: "التكريم الفلاني الأول",
      date: "2020-12-31",
      center: "مركز الرؤيا للأبحاث الفلكية",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      id:3,
      title: "التكريم الفلاني الأول",
      date: "2021-12-31",
      center: "مركز الرؤيا للأبحاث الفلكية",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
  ];