export const dataaboutme = {
    description:
      "لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل.",
    job: "أستاذ جامعي",
    date: "26 مارس 2020",
    company: "CleverZone.link",
    city: "باب الزوار، الجزائر",
    webSite: "www.mouadh.com",
  };
export const databadges = [
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/01.png",
    },
    {
      imageSrc: "/images/02.png",
    },
    {
      imageSrc: "/images/03.png",
    },
    {
      imageSrc: "/images/04.png",
    },
    {
      imageSrc: "/images/04.png",
    },
  ];
  
export const datausers = [
    {
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 2,
      invitationStatus: "sent",
    },
    {
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 0,
      invitationStatus: "notSent",
    },
    {
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 5,
      invitationStatus: "sent",
    },
    {
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 2,
      invitationStatus: "accepted",
    },
    {
      fullName: "بلال بوعيشة",
      commonFrinedsNumber: 2,
      invitationStatus: "sent",
    },
  ];
  
export const dataeducations = [
    {
      university: "جامعة الهواري بومدين - باب الزوار / الجزائر",
      title: "شهادة ليسانس  في العلوم الإجتماعية",
      startDate: "2012",
      endDate: "2015",
    },
    {
      university: "جامعة الهواري بومدين - باب الزوار / الجزائر",
      title: "شهادة الماستر  في العلوم الإجتماعية",
      startDate: "2015",
      endDate: "2017",
    },
    {
      university: "جامعة الهواري بومدين - باب الزوار / الجزائر",
      title: "شهادة الدكتوراه  في العلوم الإجتماعية",
      startDate: "2017",
      endDate: "2020",
    },
  ];
export const dataexperiences = [
    {
      title: "مطور ويب",
      company: "CleverZone.ink",
      location: "الجزائر",
      startDate: "2017 نوفمبر",
      endDate: "2020 ديسمبر",
    },
    {
      title: "مطور ويب",
      company: "CleverZone.ink",
      location: "الجزائر",
      startDate: "2017 نوفمبر",
      endDate: "2020 ديسمبر",
    },
    {
      title: "مطور ويب",
      company: "CleverZone.ink",
      location: "الجزائر",
      startDate: "2017 نوفمبر",
      endDate: "2020 ديسمبر",
    },
  ];
  
export const datacertifications = [
    {
      name: "شهادة الماستر",
      provider: "جامعة الهواري بومدين",
      startDate: "2017 نوفمبر",
      endDate: "لا تاريخ انتهاء الصلاحية",
      link: {
        url: "",
        label: "إطلع على الإعتماد",
      },
    },
    {
      name: "شهادة الماستر",
      provider: "جامعة الهواري بومدين",
      startDate: "2017 نوفمبر",
      endDate: "لا تاريخ انتهاء الصلاحية",
      link: {
        url: "",
        label: "إطلع على الإعتماد",
      },
    },
    {
      name: "شهادة الماستر",
      provider: "جامعة الهواري بومدين",
      startDate: "2017 نوفمبر",
      endDate: "لا تاريخ انتهاء الصلاحية",
      link: {
        url: "",
        label: "إطلع على الإعتماد",
      },
    },
  ];
export const datavolunteerings = [
    {
      organization: "جمعية ورقة لحماية البيئة",
      role: "متطوع في دور معين",
      startDate: "2017",
      endDate: "2020",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين",
    },
    {
      organization: "جمعية ورقة لحماية البيئة",
      role: "متطوع في دور معين",
      startDate: "2017",
      endDate: "2020",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين",
    },
    {
      organization: "جمعية ورقة لحماية البيئة",
      role: "متطوع في دور معين",
      startDate: "2017",
      endDate: "2020",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين",
    },
  ];
  
export const dataarticles = [
    {
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "6 days ago",
    },
    {
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "1 day ago",
    },
    {
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "3 weeks ago",
    },
    {
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "6 years ago",
    },
    {
      title: "عنوان طويل جدا خاص بمقال معين للإستعمال في أمور معينة",
      publishedDate: "1 month ago",
    },
  ];
  
export const datagroups = [
    {
      name: "مجموعة معينة",
      members: 134,
    },
    {
      name: "مجموعة معينة",
      members: 440,
    },
    {
      name: "مجموعة معينة",
      members: 235,
    },
    {
      name: "مجموعة معينة",
      members: 34,
    },
  ];
  
export const dataprojects = [
    {
      name: "المشروع الفلاني الأول",
      startDate: "سبتمبر 2012",
      endDate: null,
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      name: "المشروع الفلاني الثاني",
      startDate: "سبتمبر 2009",
      endDate: "ديسمبر 2010",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      name: "المشروع الفلاني الثالث",
      startDate: "سبتمبر 2002",
      endDate: "سبتمبر 2005",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
  ];
  
export const datalanguages = [
    {
      name: "العربية",
      level: "اللغة الأم أومستوى احترافي",
    },
    {
      name: "الإنجليزية",
      level: "مستوى احترافي",
    },
    {
      name: "الفرنسية",
      level: "مستوى متوسط",
    },
  ];
  
export const dataactivities = [
    {
      name: "النشاط الفلاني الأول",
      startDate: "20/9/2020",
      endDate: "25/9/2020",
      center: "مؤسسة الرؤيا للأبحاث الفلكية",
      role: "محاضر",
      location: "مصر",
    },
    {
      name: "النشاط الفلاني الأول",
      startDate: "20/9/2020",
      endDate: "25/9/2020",
      center: "مؤسسة الرؤيا للأبحاث الفلكية",
      role: "محاضر",
      location: "مصر",
    },
    {
      name: "النشاط الفلاني الأول",
      startDate: "20/9/2020",
      endDate: "25/9/2020",
      center: "مؤسسة الرؤيا للأبحاث الفلكية",
      role: "محاضر",
      location: "مصر",
    },
  ];
  
export const datapatents = [
    {
      name: "براءة الاختراع الأولى",
      startDate: "سبتمبر 2012",
      endDate: "ديسمبر 2015",
      status: "تم الاصدار",
      center: "المكتب الفلاني للإختراعات",
      code: "ED1059",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      name: "براءة الاختراع الأولى",
      startDate: "سبتمبر 2012",
      endDate: "ديسمبر 2015",
      status: "تم الاصدار",
      center: "المكتب الفلاني للإختراعات",
      code: "ED1059",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      name: "براءة الاختراع الأولى",
      startDate: "سبتمبر 2012",
      endDate: "ديسمبر 2015",
      status: "تم الاصدار",
      center: "المكتب الفلاني للإختراعات",
      code: "ED1059",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
  ];
  
export const datahonors = [
    {
      name: "التكريم الفلاني الأول",
      date: "ديسمبر 2012",
      center: "مركز الرؤيا للأبحاث الفلكية",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      name: "التكريم الفلاني الأول",
      date: "ديسمبر 2012",
      center: "مركز الرؤيا للأبحاث الفلكية",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
    {
      name: "التكريم الفلاني الأول",
      date: "ديسمبر 2015",
      center: "مركز الرؤيا للأبحاث الفلكية",
      description:
        "خسائر اللازمة ومطالبة حدة بل. الآخر الحلفاء أن غزو, إجلاء وتنامت عدد مع. لقهر معركة لبلجيكا، بـ انه, ربع الأثنان المقيتة في, اقتصّت المحور حدة و. هذه ما طرفاً عالمية استسلام, الصين وتنامت حين ",
    },
  ];